# 【開発コンセプト】制作するアプリは（どんなターゲット層に/どんなニーズ&課題に/なぜ/何のためにアプローチする）アプリですか？
どんなアプリ？（内容）：
介護医療の現場で使いやすい、コストのかからないアプリ

# どんなターゲット層に
・介護士、看護師、リハビリ療法士、管理栄養士、医師、相談員

# どんなニーズ&課題に
・実施した医療や介護のサービスは記録が必要である。
  他のスタッフ間での情報共有や、ご家族への説明、利用料請求の為の証拠として必要となる。
・しかし、紙ベースの仕事が多く、事務作業が多いことで、本来必要な人へのサービス提供時間が確保しづらい
・情報共有する為に一般にはカルテや記録用紙に決まったフォーマットで記載をして職員が閲覧をするものであるが、
  紙媒体だと手書きによる転記の多さや、紙の印刷、綴じる、保管、移動などが必要で事務作業の負担が大きい
・電子媒体の場合、様々な介護支援ソフトが現在もあるが、不要な機能があったり、施設ごとにあったものがなく、コストもかかってしまう


# なぜ？何のために？（開発理由・経緯）：
・上記の通り、使いやすいソフトが少ない、決まったフォーマットで我慢しないといけないため、これまでワードやエクセルで作成してきた。
・エクセルだとファイルが壊れたり、共有が外れたりする
・エクセルは特殊なソフトだと拒否反応を示す人がいる
・パソコンは難しいものと思い込んでいる人がいる
・そこで、使いやすく、コストがかからず、ベテランスタッフも利用しやすいものを作成したい


# 【実装機能・内容】制作するアプリにはどんな機能を実装予定ですか？（箇条書きでも可・中長期的な目標でも可）
・利用者の氏名や年齢などの基本的な情報を登録する
・利用者ごとに業務に必要な記録用紙を作成する際に、登録した情報を呼び出せる
・施設の入退所情報を登録し、一覧表で確認ができる
・図にて現在の入所状況が分かる
・定期的に行われる会議の該当者リストを設定した日付ごとに表示できる
・日々の血圧や体温などのバイタルチェック表を作成でき、タブレットを使って現場まで行ってバイタル測定や記録ができる
・利用者ごとの記録ではコメントや写真を投稿でき、みんなで共有できる


# 【アクションプラン】上記コンセプトのアプリ開発を終えた際に、あなたはどのようになっていたい（何を身につけていたい）ですか？スキル・マインド面共に書き出しましょう！
スキル面：エクセルの共有機能を使用しなくても、オフラインで施設内で共有できるソフト、自分で作りたいもの、課題を解決できるものを自作できる

マインド面：本当にできるのかと不安になっていたものが自信へと変わっている


# ・アプリ構想：◯/◯（◯）〜◯/◯（◯）
・DB設計：（〜〜〜下記も同様に日付を記載〜〜）
・フロント実装：
・機能実装 ①：
・機能実装 ②：
・機能実装 ③：
・デプロイ・動作確認・ビュー調整：
